In [14]:
import pandas as pd

df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

df

   A  B
0  1  4
1  2  5
2  3  6

In [15]:
df = df.rename(columns={'A': 'X', 'B': 'Y'})
df

   X  Y
0  1  4
1  2  5
2  3  6

In [16]:
df = df.rename(index={0: 'a', 1: 'B', 2: 'c'})
df

   X  Y
a  1  4
B  2  5
c  3  6

In [17]:
df = df.rename(columns=str.lower)
df

   x  y
a  1  4
B  2  5
c  3  6

In [18]:
df = df.rename(index=str.lower)
df

   x  y
a  1  4
b  2  5
c  3  6

In [22]:
df.rename(columns={'x': 'XZ'}, inplace=True)
df

   XZ  y
a   1  4
b   2  5
c   3  6

In [23]:
df = df.rename({'y': 'y1000'}, axis=1)  # Rename columns
df = df.rename({'a': 'a20000'}, axis=0)  # Rename rows

In [24]:
df

        XZ  y1000
a20000   1      4
b        2      5
c        3      6